export const DataHomepage = [
  {
    id: '0',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
  {
    id: '1',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
  {
    id: '2',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
  {
    id: '3',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
  {
    id: '4',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
  {
    id: '5',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
  {
    id: '6',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
  {
    id: '7',
    title: '如何使用JavaScript如何使用JavaScript',
    date: '2019-4-19',
    abstract: '今年早些时候，奇舞团开源的 Node.js 框架 ── ThinkJS ' +
      '迎来了她的 3.0 版本。 尽管今年我很少更新博客，但「每次 ThinkJS ' +
      '发布大版本，我都要更新博客程序」 的老传统还是不能丢。所以，' +
      '你现在看到的这个博客，已经是基于 ThinkJS 3 全面重构后的新版。'
  },
]

export const DataArchive = [
  {
    year: '2019',
    titleList: [
      {
        id: '001',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
      {
        id: '002',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
      {
        id: '003',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
    ]
  },
  {
    year: '2018',
    titleList: [
      {
        id: '004',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
      {
        id: '005',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
      {
        id: '006',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
    ]
  },
  {
    year: '2017',
    titleList: [
      {
        id: '007',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
      {
        id: '008',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
      {
        id: '009',
        title: '这是一篇文章',
        date: '2019-04-19'
      },
    ]
  },
]

export const categoryData = [
  {
    categoryTitle: 'HTTP相关',
    categoryResume: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只' +
      '是多了几篇收藏，或者是 Evernote 里多了几段' +
      '零散的记录',
    titleList: [
      {
        id: '1',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '2',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '3',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '4',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
    ]
  },
  {
    categoryTitle: 'JAVA',
    categoryResume: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只' +
      '是多了几篇收藏，或者是 Evernote 里多了几段' +
      '零散的记录',
    titleList: [
      {
        id: '11',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '12',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '13',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '14',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
    ]
  },
  {
    categoryTitle: '数据结构',
    categoryResume: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只' +
      '是多了几篇收藏，或者是 Evernote 里多了几段' +
      '零散的记录',
    titleList: [
      {
        id: '21',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '22',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '23',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '24',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
    ]
  },
  {
    categoryTitle: '前端框架',
    categoryResume: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只' +
      '是多了几篇收藏，或者是 Evernote 里多了几段' +
      '零散的记录',
    titleList: [
      {
        id: '31',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '32',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '33',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
      {
        id: '34',
        title: '这是一篇文章这是一篇文章',
        date: '2019-04-12'
      },
    ]
  },
]

export const aboutData = [
  {
    id: '100',
    title: '个人介绍',
    content: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只是' +
      '多了几篇收藏，或者是 Evernote 里多了几段零散' +
      '的记录，'
  },
  {
    id: '101',
    title: '版权声明',
    content: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只是' +
      '多了几篇收藏，或者是 Evernote 里多了几段零散' +
      '的记录，'
  },
  {
    id: '102',
    title: '支持本站',
    content: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只是' +
      '多了几篇收藏，或者是 Evernote 里多了几段零散' +
      '的记录，'
  },
  {
    id: '103',
    title: '关于本站',
    content: '博客写了这么多年，数量一直没上去。' +
      '大部分时候遇上有意思的东西， 研究明白之后只是' +
      '多了几篇收藏，或者是 Evernote 里多了几段零散' +
      '的记录，'
  },
]
